0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            turbulentInlet;
        referenceField  uniform (0 0 -10);
        fluctuationScale (0.01 0.01 0.02);
        value           uniform (0 0 -10);
    }

    Outlet
    {
        type            zeroGradient;

    }

    Wall
    {
        type            noSlip;
    }

   }
// ************************************************************************* //
